{
        "ENTR": {
                "name": "Entrance",
                "desc": "This is the entrance to a dark cavern. Your trials await!",
                "exits": [{
                    "exit": "NORTH",
			        "target": "CAV1"
                }]
        },
        "CAV1": {
            "name": "Cavern #1",
            "desc": "The bones of previous adventurers litter the floor of this cavern.\nYou see several spatters of blood and gore as you walk towards the center of the cavern.\nA small exit to the northwest is barely visible, and a large opening can be seen to the north as you hide from a passing goblin patrol.",
            "exits": [{
                "exit": "NORTH",
                "target": "CAV3"
            },
            {
                "exit": "NW",
                "target": "CAV2"
            }]
    },
    "CAV2": {
        "name": "Cavern #2",
        "desc": "A small, cramped cavern forces you to go down on all fours.\nAs you crawl, you see a bright light curving to the east. You hear the ceiling behind you beginning to collapse.",
        "exits":[
        {
            "exit": "EAST",
            "target": "CAV3"
        }]
},
"CAV3": {
    "name": "Cavern #3",
    "desc": "A large cavern full of sparkling crystals fills your vision. A pond sits in the middle of the cavern with crystal clear liquid.\nThere is a giant ornate door to the north. Two smaller caverns branch to the east and west.\nThe liquid bubbles and hisses as you careful move across the chamber.",
    "exits": [{
        "exit": "EAST",
        "target": "SHAM"
    },
    {
        "exit": "WEST",
        "target": "CAV2"
    },
    {
        "exit": "SOUTH",
        "target": "CAV1"
    },
    {
        "exit": "NORTH",
        "target": "HALL"
    }
]
},
"HALL": {
    "name": "Feasting Hall",
    "desc": "The Hall has four large doors to the north, east, west and south.\nSeveral drunk goblins are passed out at the tables in the room.",
    "exits": [{
        "exit": "NORTH",
        "target": "BONF"
    },
    {
        "exit": "EAST",
        "target": "ARMO"
    },
    {
        "exit": "WEST",
        "target": "BOSS"
    },
    {
        "exit": "SOUTH",
        "target": "CAV3"
    }]
},
"ARMO": {
    "name": "Armory",
    "desc": "A burning forge sits in the corner. A dwarven blacksmith sees you come in and grins.\nHe holds out a mythril sword with a nod and points at a door to the north.",
    "exits": [{
        "exit": "WEST",
        "target": "HALL"
    },{
        "exit": "NORTH",
        "target": "PET1"
    }]
},
"BONF": {
    "name": "Cooking Bonfire",
    "desc": "Several goblins are roasting meat over a roaring fire. Several small bits of meat lay out cooling as they focus on their work.",
    "exits": [{
        "exit": "SOUTH",
        "target": "HALL"
    }]
},
"BOSS": {
    "name": "Goblin Boss Throne",
    "desc": "A portly goblin in royal red robes sits upon a groaning wooden throne.\nHe goes wide-eyed as you enter,'If you have slipped passed my guards, maybe you can defeat the Ear!' Take the rod on the wall!",
    "exits": [{
        "exit": "EAST",
        "target": "HALL"
    }]
},
"SHAM": {
    "name": "Shaman's Quarters",
    "desc": "A small table with an old woman behind it sits in this room.\nShe smiles a toothless grin and holds out a closed hand to you.",
    "exits": [{
        "exit": "WEST",
        "target": "CAV3"
    }]
},
"PET1": {
    "name": "Pet Dragon Nest",
    "desc": "Inside this room sleeps a young blue dragon.\nIts iridescent blue scales shine with sparking electricity as its giant form rises as you enter.\nIt's lightning zips past your head as you look for a way out.\nTo the north is a metal door scarred with lightning",
    "exits": [{
        "exit": "SOUTH",
        "target": "ARMO"
    }, 
    {
        "exit": "NORTH",
        "target": "BEDR"
    }
    ]
},
"BEDR": {
    "name": "Beholder's Scrying Chamber",
    "desc": "You have reached the room of the Great Beholder, Coeryn The Ear!\n He spins his eyestalks towards you and you duck under his eye rays\nLooking around you can see several objects scattered around the room and a vault in the north of the room",
    "exits": [{
        "exit": "NORTH",
        "target": "TREASR"
    }]
},
"TREASR": {
    "name": "Treasure Room",
    "desc": "You have found the treasure hoard of the Great Beholder, Coeryn The Ear!\nAs you grab as many gold, platinum and jeweled baubles you can find,\nyou see a small hatch in the floor. Loot in tow, you climb out to the surface and vanish into the night, victorious!!",
    "exits":[
        {
        "exit": "",
        "target": ""
    }]
}



}
